{"translation-revision-date":"2024-08-19 15:41:14+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n != 1;","lang":"it"},"Filename Suffix":["Suffisso del nome del file"],"Filename Prefix":["Prefisso del nome del file"],"Prompt for Caption":["Suggerimento testuale (Prompt) della descrizione per la didascalia"],"Prompt for ALT Text":["Suggerimento testuale (Prompt) della descrizione del testo alternativo (ALT)"],"Prompt for Description":["Suggerimento testuale (Prompt) della descrizione"],"Prompt for Title":["Suggerimento testuale (Prompt) della descrizione per il titolo"],"Prompt for Filename":["Suggerimento testuale (Prompt) della descrizione del nome del file"],"Manually change the prompts for the AI suggestions.":["Cambia manualmente le richieste per i suggerimenti dell'IA."],"Manual Prompts":["Suggerimenti testuali (Prompt) manuali"],"Reset":["Reimpostare"],"You are about to force re-sync the enabled metadata fields for all of your unlocked entries. Are you sure you would like to proceed? (All of the enabled metadata fields in the table will be synced with the current media filename.)":["Stai per risincronizzare forzatamente i campi dei metadati abilitati per tutte le tue voci sbloccate. Sei sicuro di voler procedere? (Tutti i campi dei metadati abilitati nella tabella saranno sincronizzati con il nome del file multimediale corrente)."],"AI Vision will use the EXIF data (title, caption, keywords) to enhance its suggestions.":["AI Vision utilizzerà i dati EXIF (titolo, didascalia, parole chiave) per migliorare i suoi suggerimenti."],"EXIF Context":["Contesto EXIF"],"<b>Auto Retry<\/b> will retry the actions up to 10 times. It will increase the delay at every try to avoid timeouts. <b>Auto Skip<\/b> will simply skip the failed action.":["<b>Riprova automaticamente<\/b> riprova le azioni fino a 10 volte. Aumenterà il ritardo ad ogni tentativo per evitare problemi di timeout. <b>Salta automaticamente<\/b> salta semplicemente l'azione fallita."],"Skip":["Salta"],"Auto Skip":["Salta automaticamente"],"Auto Retry":["Riprova automaticamente"],"Error with Media":["Errore con i media"],"Reset Metadata":["Reimposta i metadati"],"The filename proposed by {0} already exists. Please select another method or rename manually.":["Il nome del file proposto da {0} esiste già. Seleziona un altro metodo o rinominalo manualmente."],"The filename proposed by {0} already exists. Automatically switched to {1}.":["Il nome del file proposto da {0} esiste già. Passa automaticamente a {1}."],"Filename & Metadata":["Nome del file e metadati"],"Vision Upload":["Vision Upload"],"EXIF Upload":["EXIF Upload"],"⚠️ No fields selected.":["⚠️ Non è stato selezionato alcun campo."],"Rules":["Regole"],"Scope":["Ambito"],"Error while importing settings. Please check your console.":["Errore durante l'importazione delle impostazioni. Controlla la tua console."],"Settings imported. The page will now reload to reflect the changes.":["Impostazioni importate. La pagina verrà ricaricata per riflettere le modifiche."],"Error while exporting settings. Please check your console.":["Errore durante l'esportazione delle impostazioni. Controlla la tua console."],"Display of the features in the Media Library.":["Visualizzazione delle caratteristiche della libreria dei media."],"Media Library":["Libreria dei media"],"An 'Attached To' column will be displayed.":["Verrà visualizzata la colonna \"Allegato a\"."],"AI Engine":["AI Engine"],"The filename will be adapted based on the selected method.":["Il nome del file verrà adattato in base al metodo selezionato."],"Replace by the MD5 used by the filename.":["Sostituisci con l'MD5 utilizzato dal nome del file."],"Replace by the Attached Post Title.":["Sostituisci con il titolo dell'articolo allegato."],"Replace by the AI Vision's suggestion.":["Sostituisci con il suggerimento di AI Vision."],"Replace by the Post ACF Field.":["Sostituito dal campo Articolo di ACF."],"Replace by the Post Title.":["Sostituisci con il titolo dell'articolo."],"Replace by the ALT Text.":["Sostituisci con il testo ALT."],"Replace by the Media Title.":["Sostituisci con il titolo del media."],"Replace by the filename.":["Sostituisci con il nome del file."],"Replace by the EXIF Title.":["Sostituisci con il titolo EXIF."],"The EXIF Title will be cleaned and used as the new filename.":["Il titolo EXIF verrà ripulito ed utilizzato come nuovo nome del file."],"The original filename will be cleaned and used as the new filename.":["Il nome del file originale verrà ripulito ed utilizzato come nuovo nome del file."],"Generate":["Genera"],"When AI Vision analysis is cached, completion requests will be prioritized, enhancing speed and reducing API calls.":["Quando l'analisi di AI Vision viene memorizzata nella cache, le richieste di completamento avranno la priorità, migliorando la velocità e riducendo le chiamate dell'API."],"AI Vision Cache":["AI Vision Cache"],"The filename will be automatically renamed based on the selected methods. The first method that returns a valid filename will be used.":["Il nome del file verrà rinominato automaticamente in base ai metodi selezionati. Verrà utilizzato il primo metodo che restituisce un nome del file valido."],"Sync Fields (Post-Rename Events)":["Campi di sincronizzazione (eventi post-rinominazione)"],"After the upload, the metadata can be updated based on those methods.":["Dopo il caricamento, i metadati possono essere aggiornati in base a questi metodi."],"Modify the metadata directly in the Dashboard, manually or with AI Suggestions.":["Modifica i metadati direttamente nella bacheca, manualmente oppure con i suggerimenti dell'IA."],"Rename Button -> Modal":["Rinomina pulsante -> Modal"],"Rename Field with All Features":["Rinomina il campo con tutte le funzioni"],"MD5":["MD5"],"Post Title":["Titolo dell'articolo"],"Attached Post (ACF Field)":["Articolo allegato (Campo di ACF)"],"Move selected {0} Entries":["Sposta le voci {0} selezionate"],"No Capiton":["Nessuna didascalia"],"Edit":["Modifica"],"Post":["Articolo"],"Alt":["Alt"],"Sync&nbsp;<strong>{0}<\/strong>&nbsp;Entries":["Sincronizzazione&nbsp;<strong>{0}<\/strong>&nbsp;Voci"],"Lock&nbsp;<strong>{0}<\/strong>&nbsp;Entries":["Blocca&nbsp;<strong>{0}<\/strong>&nbsp;Voci"],"Unlock&nbsp;<strong>{0}<\/strong>&nbsp;Entries":["Sblocca&nbsp;<strong>{0}<\/strong>&nbsp;Iscrizioni"],"Undo&nbsp;<strong>{0}<\/strong>&nbsp;Entries":["Annulla&nbsp;<strong>{0}<\/strong>&nbsp;Iscrizioni"],"Move&nbsp;<strong>{0}<\/strong>&nbsp;Entries":["Sposta&nbsp;<strong>{0}<\/strong>&nbsp;Inserimenti"],"Rename&nbsp;<strong>{0}<\/strong>&nbsp;Entries":["Rinomina&nbsp;<strong>{0}<\/strong>&nbsp;Voci"],"The logs will also be written in the PHP error logs.":["I log verranno scritti anche nei log degli errori di PHP."],"PHP Error Logs":["Log degli errori di PHP"],"Generate metadata based on a refined filename.":["Genera i metadati in base ad un nome del file perfezionato."],"Generate metadata with AI Vision. It increases processing times.":["Genera i metadati con AI Vision. Aumenta i tempi della lavorazione."],"Caption":["Didascalia"],"Import Options":["Opzioni d'importazione"],"Export Options":["Opzioni d'esportazione"],"Rename files with their EXIF titles, if present.":["Rinomina i file con i loro titoli EXIF, se presenti."],"Nothing will be done on upload.":["Non verrà fatto nulla per il caricamento."],"EXIF Title":["Titolo EXIF"],"When you rename a file the plugin will automatically sync the fields you have enabled in \"Fields Syncing\". If you want to disable this behavior when manually renaming, check this option.":["Quando rinomini un file, il plugin sincronizza automaticamente i campi che hai abilitato in \"sincronizzazione dei campi\". Se desideri disattivare questo comportamento durante la ridenominazione manuale, seleziona questa opzione."],"Manual Sync":["Sincronizzazione manuale"],"The number of entries to keep in the History column.":["Il numero di voci da conservare nella colonna della cronologia."],"History Limit":["Limite della cronologia"],"The History column will be added to the dashboard table.":["La colonna della cronologia viene aggiunta alla tabella della bacheca."],"UI":["Interfaccia utente"],"After Manual Rename":["Dopo la ridenominazione manuale"],"After Automatic Rename":["Dopo la ridenominazione automatica"],"A lock icon will be added, and will allow you to lock a file to avoid future actions.":["Viene aggiunta un'icona di blocco che ti consentirà di bloccare un file per evitare azioni future."],"🤖 When syncing using AI Engine, the plugin will use AI to generate <b>each field<\/b> you selected individually. This is a very powerful feature, but it might take a bit of time to process.":["🤖 Durante la sincronizzazione utilizzando AI Engine, il plugin utilizza l'IA per generare <b>ogni campo<\/b> selezionato individualmente. Questa è una funzionalità molto potente, ma l'elaborazione potrebbe richiedere un po' di tempo."],"Disable":["Disabilitare"],"Features":["Caratteristiche"],"Renaming Methods":["Metodi di ridenominazione"],"Rename your media":["Rinomina i tuoi media"],"Exit":["Esci"],"All the Metadata fields you have enbaled will also be generated by AI Vision.":["Tutti i campi dei metadati che hai abilitato verranno generati anche da AI Vision."],"You are about to rename all the files in this table":["Stai per rinominare tutti i file in questa tabella"],"Apply":["Applica"],"Cancel":["Cancella"],"Cancel manual rename":["Annulla la ridenominazione manuale"],"File":["File"],"History":["Cronologia"],"Synced":["Sincronizzato"],"Synchronize Fields of All Entries":["Sincronizza i campi di tutte le voci"],"Never Renamed":["Mai rinominato"],"AI":["IA"],"⚠️ You already have Clean Uploads enabled, which will overwrite the title, description, and alt text.":["⚠️ Hai già abilitato i caricamenti puliti, che sovrascriveranno il titolo, la descrizione ed il testo alternativo."],"AI Vision suggests refined Titles, Descriptions, and Alt Texts, potentially extending processing times.":["AI Vision suggerisce titoli, descrizioni e testi alternativi perfezionati, estendendo potenzialmente i tempi di elaborazione."],"AI Vision On Upload":["AI Vision caricamento"],"No Description":["Nessuna descrizione"],"No ALT Text":["Nessun testo alternativo"],"No Title":["Senza titolo"],"Sync":["Sincronizza"],"⚠️ You should first run a scan using <a href=\"https:\/\/meowapps.com\/media-cleaner\/\" target=\"_blank\">Media Cleaner<\/a> to create all your media references. Otherwise, the auto-attach feature will not work properly.":["⚠️ Dovresti prima eseguire una scansione utilizzando <a href=\"https:\/\/meowapps.com\/media-cleaner\/\" target=\"_blank\">Media Cleaner<\/a> per creare tutti i tuoi riferimenti dei media. In caso contrario, la funzione di collegamento automatico non funzionerà correttamente."],"This will analyze your images and give you perfect suggestions based on your images.":["Questo analizza le tue immagini e ti fornisce suggerimenti perfetti basati sulle tue immagini."],"AI Vision":["AI Vision"],"This will give you suggestions based on what the AI sees in your metadata.":["Questo ti fornisce suggerimenti in base a ciò che l'IA trova nei tuoi metadati."],"An editable field will be added to edit your filenames.":["Verrà aggiunto un campo modificabile per modificare i nomi dei file."],"Clean Upload":["Caricamento pulito"],"Alternative Text":["Testo alternativo"],"Metadata Fields":["Campi del metadato"],"Description":["Descrizione"],"Auto-Attach Selected Media Entries":["Allega automaticamente le voci dei media selezionati"],"Auto-Attach All Media Entries":["Allega automaticamente tutte le voci dei media"],"All your posts, pages, products (and other post types) will be scanned, and if selected images are used in them, they will be attached. Currently, Featured Images and Product Galleries are supported.":["Tutti i tuoi articoli, pagine, prodotti (ed altri tipi di contenuti) sono scansionati e, se in essi vengono utilizzate immagini selezionate, verranno allegate. Attualmente sono supportate le immagini in primo piano e le gallerie di prodotti."],"Create Folder":["Crea cartella"],"Refresh":["Ricarica"],"Syncing Media":["Sincronizzazione dei media"],"Thumbnail":["Miniatura"],"An edit icon will be added, and will allow you to edit the Alternative Text.":["Viene aggiunta un'icona di modifica che ti consentirà di modificare il testo alternativo."],"ALT Field":["Campo del testo alternativo"],"<a href='https:\/\/wordpress.org\/plugins\/ai-engine\/' target='_blank'>AI Engine<\/a> needs to be installed. It's free!":["È necessario installare <a href='https:\/\/wordpress.org\/plugins\/ai-engine\/' target='_blank'>AI Engine<\/a>. È gratis!"],"Reset Options":["Reimposta le opzioni"],"This is enabled by default; when you rename a media manually, it normally means that you want to fix the filename by yourself.":["Questo è abilitato per impostazione predefinita; quando si rinomina manualmente un media, normalmente significa che desideri correggere il nome del file da solo."],"This is disabled by default; your media will be always renamed when needed.":["Questa impostazione è disabilitata per impostazione predefinita; i tuoi file dei media verranno sempre rinominati quando necessario."],"Time to wait between each request (in milliseconds). The overall process is intensive so this gives the chance to your server to chill out a bit. A very good server doesn't need it, but a slow\/shared hosting might even reject requests if they are too fast and frequent. Recommended value is actually 0, 100 for safety, 2000 or 5000 if your hosting is kind of cheap.":["Tempo di attesa tra ogni richiesta (in millisecondi). Il processo complessivo è intenso, quindi questo ti la possibilità al tuo server di rilassarsi un po'. Un server potente non ne ha bisogno, ma un hosting lento \/ condiviso potrebbe addirittura rifiutare le richieste se, queste, sono troppo veloci e frequenti. Il valore consigliato è in realtà 0, 100 per sicurezza, 2000 o 5000 se il tuo hosting è abbastanza economico."],"Delay (in ms)":["Ritardo (in ms)"],"The database and all the options of the plugin will be removed on uninstall. This also includes the information about the plugin's trash.":["Il database e tutte le opzioni del plugin verranno rimossi durante la disinstallazione. Questo include anche le informazioni sul cestino del plugin."],"Plugin Data":["Dati del plugin"],"Delete all":["Elimina tutto"],"Rename on Post Save":["Rinomina al salvataggio dell'articolo"],"Enable (Unsafe)":["Abilita (non sicuro)"],"This will consider the file such as \"abc.jpg\" and \"ABC.JPG\" as the same file. More information <a target=\"_blank\" href=\"https:\/\/meowapps.com\/media-file-renamer-faq-issues\/\">here<\/a>. You should check this if you are on a Windows-based server.":["Questo considera il file come \"abc.jpg\" e \"ABC.JPG\" come lo stesso file. Maggiori informazioni <a target=\"_blank\" href=\"https:\/\/meowapps.com\/media-file-renamer-faq-issues\/\">qui<\/a>. Dovresti controllare se utilizzi un server basato su Windows."],"Case Insensitive":["Senza distinzione tra maiuscole e minuscole"],"GUID":["GUID"],"The files sql.log and sql_revert.log will be created under the log's directory and will include the raw SQL queries which were run by the plugin. If there is an issue, the revert SQL file can help you.":["I file sql.log e sql_revert.log vengono creati nella directory dei log ed includono le query SQL grezze eseguite dal plugin. Se si verifica un problema, il ripristino del file SQL ripristinato può aiutarti."],"SQL Logs":["Log SQL"],"Clear Logs":["Svuota i log"],"Refresh Logs":["Aggiorna i log"],"Simple logging that explains which actions has been run.":["Registrazione semplice che spiega quali azioni sono state eseguite."],"ALT Text":["Testo alternativo"],"Synchronize":["Sincronizza"],"Numbered Files":["File numerati"],"Force Rename":["Forza la rinominazione"],"Everything you type will be sanitized. This way, you can be certain the filename is safe and tidy.":["Tutto ciò che digiti viene sanificato. In questo modo, puoi essere certo che il nome del file sia sicuro ed ordinato."],"Sanitize":["Sanifica"],"AI Suggestions":["Suggerimenti dell'IA"],"An editable field will be added.":["Viene aggiunto un campo modificabile."],"Rename Field":["Rinomina campo"],"A move button will be added, and will allow you to move a file to another directory.":["Viene aggiunto un pulsante di spostamento che ti consentirà di spostare un file in un'altra directory."],"An undo icon will be added to the UI. This allows to rollback to the original filename.":["Un'icona per  l'annullamento verrà aggiunta all'interfaccia utente. Questo ti consente di ripristinare il nome del file originale."],"Undo":["Annullare"],"Replace accents, emoticons, diacritics, umlauts, cyrillic and any kind of tricky characters by their ASCII equivalent.<br \/> <i>Examples: tête &#8594; tete, schön &#8594; schon, Добро &#8594; dobro, etc.<\/i>":["Sostituisci accenti, emoticon, segni diacritici, dieresi, cirillico e qualsiasi altro tipo di carattere complesso con il loro equivalente ASCII.<br \/> <i>Esempi: tête → tete, schön → schon, Добро → dobro, etc.<\/i>"],"Enable (Recommended)":["Attiva (raccomandato)"],"Transliteration":["Traslitterazione"],"Slug\/Permalink":["Slug \/ Permalink"],"Sync with filename":["Sincronizza con il nome del file"],"Note: The Attached Post Title <u>will not be used<\/u> at the time of the upload due to WordPress API constraints.":["Nota: il titolo dell'articolo allegato <u>non verrà utilizzato<\/u> al momento del caricamento a causa dei vincoli dell'API di WordPress."],"On Upload":["Al caricamento"],"Restricts the renaming to Featured Images only.":["Limita la ridenominazione solo alle immagini in primo piano."],"Featured Only":["Solo in primo piano"],"Restricts the renaming to images and icons. Nothing else will be renamed.":["Limita la ridenominazione alle immagini ed alle icone. Nient'altro verrà rinominato."],"Images Only":["Solo immagini"],"ACF Field Name":["Nome del campo di ACF"],"Attached Post includes all kinds of Post Types: Posts, Pages, Products, etc.":["L'articolo allegato include tutti i tipi di contenuti: articoli, pagine, prodotti, etc."],"Method":["Metodo"],"Logs & Debug":["Log &amp; debug"],"License (Pro)":["Licenza (Pro)"],"For Advanced Users & Developers":["Per utenti avanzati &amp; sviluppatori"],"For Developers":["Per sviluppatori"],"Performance":["Prestazioni"],"Auto Lock":["Blocco automatico"],"The fields in the database will be synchronized, but the data already written in your HTML will not be overwritten.":["I campi nel database verranno sincronizzati, ma i dati già scritti nel tuo HTML non verranno sovrascritti."],"Fields Syncing":["Sincronizzazione dei campi"],"Advanced":["Avanzato"],"Manual":["Manuale"],"It works out of the box, the default settings are good for most installs. However, you should really have a look at the <a href='https:\/\/meowapps.com\/plugin\/media-file-renamer\/'>tutorial<\/a>. If you are a SEO guru or someone who loves having a perfectly neat filesystem, it is recommended to use automatic renaming first, then to tweak specific files with manual renaming. The <a href='\/wp-admin\/upload.php?page=mfrh_dashboard'>Renamer Dashboard<\/a> makes it very easy.":["Funziona immediatamente, le impostazioni predefinite sono adatte per la maggior parte delle installazioni. Tuttavia, dovresti davvero dare un'occhiata a questa <a href='https:\/\/meowapps.com\/plugin\/media-file-renamer\/'>guida<\/a>. Se sei un guru del SEO oppure qualcuno che ama avere un filesystem sempre perfettamente ordinato, ti consiglio di utilizzare prima la ridenominazione automatica, quindi di modificare file specifici con la ridenominazione manuale. La <a href='\/wp-admin\/upload.php?page=mfrh_dashboard'>bacheca della ridenominazione<\/a> rende tutto questo molto semplice."],"Failed to move the folder\/gallery.":["Impossibile spostare la cartella \/ galleria."],"The modal {0} doesn't exist.":["Il modal {0} non esiste."],"Updating...":["Aggiornamento in corso..."],"Rename":["Rinomina"],"Update the references in the <strong>encrypted data<\/strong> of the posts handled by Elementor. <span>This will probably slow down the renaming extremely and cause timeouts. Test it carefully.<\/span>":["Aggiorna i riferimenti nei <strong>dati crittografati<\/strong> degli articoli gestiti da Elementor. <span>Questo probabilmente rallenterà notevolmente la ridenominazione e causerà problemi di timeout. Provalo con attenzione.<\/span>"],"Elementor":["Elementor"],"Update the references in the <strong>custom fields<\/strong> of the posts (including pages and custom types metadata).":["Aggiorna i riferimenti nei <strong>campi personalizzati<\/strong> degli articoli (compresi i metadati delle pagine e dei tipi personalizzati)."],"Update the references to the renamed files in the <strong>excerpts<\/strong> of the posts (of all types).":["Aggiorna i riferimenti ai file rinominati nelle <strong>citazioni<\/strong> dei contenuti (di tutti i tipi)."],"Excerpts":["Citazioni"],"Update the references to the renamed files in the <strong>content<\/strong> of the posts (of all types).":["Aggiorna i riferimenti ai file rinominati nel <strong>contenuto<\/strong> degli articoli (di tutti i tipi)"],"Side Updates":["Aggiornamenti laterali"],"Disable Automatic Rename":["Disabilita la ridenominazione automatica"],"Anonymize with MD5":["Rendi sicuro e privato con l'hash crittografico MD5"],"Based on Alternative Text":["Basato sul testo alternativo"],"Based on Attached Post (Title)":["In base al post allegato (titolo)"],"Based on Attached Post (ACF Field)":["Basato sull'articolo allegato (del campo di ACF)"],"Based on Media Title":["Basato sul titolo dei media"],"Where would you like to move this file (in the \/uploads directory)?":["Dove desideri spostare questo file (nella directory \/uploads)?"],"Move this file":["Sposta questo file"],"Success":["Successo"],"Are you sure you would like to proceed?":["Sei sicuro di volere procedere?"],"You are about to undo the renaming for all your files":["Stai per annullare la ridenominazione di tutti i tuoi file"],"Renaming files is a dangerous operation. Please make sure you made a backup of your entire WordPress install. Should we start?":["Rinominare i file è un'operazione pericolosa. Assicurati di aver effettuato un backup dell'intera installazione di WordPress. Vuoi iniziare?"],"Automatically attach your images to your posts":["Allega automaticamente le tue immagini ad i tuoi articoli"],"This feature only for Pro users. If you are pro user, you can go through the folders.":["Questa funzionalità è disponibile solo per gli utenti Pro. Se sei un utente pro, puoi esaminare le cartelle."],"Selectable folders":["Cartelle selezionabili"],"Where would you like to move these files (in the \/uploads directory)?":["Dove desideri spostare questi file (nella directory \/uploads)?"],"Stop":["Stop"],"Retry":["Riprova"],"Close":["Chiudi"],"I need the Pro Version":["Hai bisogno della versione Pro"],"Run":["Esegui"],"Rename manually":["Rinomina manualmente"],"Rename automatically":["Rinomina automaticamente"],"Rollback to original":["Ripristino dell'originale"],"Lock, to avoid future actions":["Blocca, per evitare azioni future"],"Unlock, to allow future actions":["Sblocca, per consentire azioni future"],"Moving":["Trasferimento"],"Please check the files at least 1 file you would like to move in bulk.":["Controlla almeno 1 file che desideri spostare in massa."],"Renaming":["Rinominando"],"Unlocking...":["Sbloccando..."],"Locking...":["Bloccando..."],"Analyzing...":["Analizzando..."],"Undo Media":["Annulla i media"],"Undoing...":["Annullare..."],"Auto attaching...":["Allegato in automatico..."],"Preparing...":["Preparazione..."],"The process has finished, but {0} error(s) occurred (check your console).":["Il processo è terminato, ma si sono verificati {0} errori (controlla la tua console)."],"items per page":["elementi per pagina"],"It's all clean & nice here! 👍<br \/>Why not trying to give a boost to your database with <a target='_blank' href='https:\/\/wordpress.org\/plugins\/database-cleaner\/'>Database Cleaner<\/a>? 😌":["È tutto pulito e carino qui! 👍<br \/>Perché non provi a dare una spinta in più al tuo database con <a target='_blank' href='https:\/\/wordpress.org\/plugins\/database-cleaner\/'>Database Cleaner<\/a>? 😌"],"Path":["Percorso"],"Filename":["Nome del file"],"Attached To":["Allegato a"],"All":["Tutto"],"Unlocked":["Sbloccato"],"Locked":["Bloccato"],"Pending":["In sospeso"],"Sync Fields":["Sincronizza i campi"],"Undo <strong>All<\/strong>":["Annullare <strong>tutto<\/strong>"],"Rename <strong>All<\/strong>":["Rinomina <strong>tutto<\/strong>"],"Unlock <strong>All<\/strong>":["Sblocca <strong>tutto<\/strong>"],"Lock <strong>All<\/strong>":["Blocca <strong>tutto<\/strong>"],"Lock":["Blocca"],"Analyze Library":["Analizza libreria"],"Move":["Sposta"],"Mode":["Modalità"],"You must <b>backup the uploads folder and DB<\/b> before using the Renamer. If you don't know how, give a try to <a target='_blank' href='https:\/\/meow.click\/blogvault'>BlogVault<\/a>. It is also highly recommanded to read the tutorial. Last but not least, check the <b>Pro Version<\/b>, as it adds many features and also supports the development. This message is only displayed in the free version. Thank you!":["È necessario <b>fare il backup della cartella degli upload e del database<\/b> prima di utilizzare il rinominatore. Se non sai come fare, prova <a target='_blank' href='https:\/\/meow.click\/blogvault'>BlogVault<\/a>. Inoltre si consiglia vivamente di leggere la guida. Ultimo ma non meno importante, controlla la <b>versione Pro<\/b>, perché aggiunge molte funzionalità ed aiuta anche a supportare lo sviluppo. Questo messaggio viene visualizzato solo nella versione gratuita. Grazie!"],"Read the tutorial":["Leggi la guida"],"Get the Pro Version":["Acquista la versione Pro"],"This feature is only available in the Pro version.":["Questa funzione è disponibile solo nella versione Pro."],"All your posts, pages, products (and other post types) will be scanned, and if images are used in them, they will be attached. Currently, Featured Images and Product Galleries are supported.":["Tutti i tuoi articoli, pagine, prodotti (ed altri tipi di di contenuti) verranno scansionati e, se in essi vengono utilizzate immagini, verranno allegate. Attualmente sono supportate le immagini in primo piano e le gallerie di prodotti."],"None":["Nessuna"],"By Jordy Meow":["Di Jordy Meow"],"Settings":["Impostazioni"],"You can modify the titles of your media while editing a post but, of course, the plugin can't update the HTML at this stage. With this option, the plugin will update the filenames and HTML after that you saved the post.":["Puoi modificare i titoli dei tuoi contenuti dei media mentre modifichi un articolo ma, ovviamente, il plugin non può aggiornare l'HTML in questa fase. Con questa opzione, il plugin aggiorna i nomi dei file e l'HTML dopo aver salvato l'articolo."],"Media Title":["Titolo dei media"],"The GUID will be renamed like the new filename. Better to keep this un-checked.":["Il GUID viene rinominato come il nuovo nome file. Meglio non controllarlo."],"Identical filenames will be allowed by the plugin and a number will be appended automatically (myfile.jpg, myfile-2.jpg, myfile-3.jpg, etc).":["Il plugin consente i nomi di file identici ed un numero verrà aggiunto automaticamente (p. e.: miofile.jpg, miofile-2.jpg, miofile-3.jpg, ecc.)."],"Enable Numbering":["Abilita la numerazione"],"Enable":["Attiva"],"Better to keep this un-checked as the link might have been referenced somewhere else.":["È meglio mantenerlo deselezionato poiché il collegamento potrebbe essere stato fatto facendo riferimento da qualche altra parte."],"Tutorial":["Guida"],"Auto":["Automatico"],"Error":["Errore"],"When the files are renamed, many links to them on your WordPress might be broken. Those options are updating the references to those files. <strong>Give it a try, every install is different and it might not work for certain kind of references.<\/strong>":["Quando i file vengono rinominati, molti di questi link sul tuo sito web di WordPress potrebbero essere interrotti. Queste opzioni stanno aggiornando i riferimenti a quei file. <strong>Provalo, ogni installazione è diversa e potrebbe non funzionare per determinati tipi di riferimenti.<\/strong>"],"Post Meta":["Pubblica i meta"],"Posts":["Articoli"],"Dashboard":["Bacheca"],"Update the references to the file even if the file renaming itself was not successful. You might want to use that option if your install is broken and you are trying to link your Media to files for which the filenames has been altered (after a migration for exemple)":["Aggiorna i riferimenti al file anche se la ridenominazione del file stesso non ha avuto successo. Potresti voler utilizzare questa opzione se la tua installazione non funziona e stai tentando di collegare i tuoi contenuti dei media a file i cui nomi del file sono stati modificati (dopo una migrazione, ad esempio)"],"Media File Renamer":["Media File Renamer"],"Logs":["Log"],"Basic":["Base"],"Title":["Titolo"],"Edit Media":["Modifica media"],"Renamed":["Rinominato"]}},"comment":{"reference":"app\/i18n.js"}}